<a href="https://colab.research.google.com/github/AlanGomes107/Analise_de_dados/blob/main/Analise_de_dados01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# ***Series***

In [2]:
idades = pd.Series([15,21,30,12,24,52])

In [3]:
idades

0    15
1    21
2    30
3    12
4    24
5    52
dtype: int64

In [4]:
type(idades)

pandas.core.series.Series

In [5]:
idades.index

RangeIndex(start=0, stop=6, step=1)

In [6]:
idades = pd.Series([15,21,30,12,24,52], index=['João','Maria','Ana','Pedro','José','Karina'])

In [7]:
idades

João      15
Maria     21
Ana       30
Pedro     12
José      24
Karina    52
dtype: int64

In [8]:
idades.index

Index(['João', 'Maria', 'Ana', 'Pedro', 'José', 'Karina'], dtype='object')

In [9]:
idades.values

array([15, 21, 30, 12, 24, 52])

# ***Dataframes***

In [10]:
np.array([[1,2,3],[4,5,6],[7,8,9]])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns=['a','b','c'], index=['a','b','c'])

In [12]:
df

   a  b  c
a  1  2  3
b  4  5  6
c  7  8  9

In [13]:
df.a

a    1
b    4
c    7
Name: a, dtype: int64

In [14]:
df['a']

a    1
b    4
c    7
Name: a, dtype: int64

In [15]:
dados = {
    'nome' : ['Bill', 'Fill', 'Steve', 'Bob', 'Karina', 'João', 'José'], 
    'idade' : [21, 87, 56, 43, 28, 30, 35]
}

In [16]:
dados

{'idade': [21, 87, 56, 43, 28, 30, 35],
 'nome': ['Bill', 'Fill', 'Steve', 'Bob', 'Karina', 'João', 'José']}

In [17]:
type(dados)

dict

In [18]:
dados.keys()

dict_keys(['nome', 'idade'])

In [19]:
dados.values()

dict_values([['Bill', 'Fill', 'Steve', 'Bob', 'Karina', 'João', 'José'], [21, 87, 56, 43, 28, 30, 35]])

In [20]:
df = pd.DataFrame(dados)

In [21]:
df

     nome  idade
0    Bill     21
1    Fill     87
2   Steve     56
3     Bob     43
4  Karina     28
5    João     30
6    José     35

In [22]:
df[df['idade'] > 30]

    nome  idade
1   Fill     87
2  Steve     56
3    Bob     43
6   José     35

In [23]:
df[df.idade > 30]

    nome  idade
1   Fill     87
2  Steve     56
3    Bob     43
6   José     35

In [24]:
df = pd.DataFrame(dados, index=['a','b','c','d','e','f','g'] )

In [25]:
df

     nome  idade
a    Bill     21
b    Fill     87
c   Steve     56
d     Bob     43
e  Karina     28
f    João     30
g    José     35

In [26]:
df[df.idade > 30]

    nome  idade
b   Fill     87
c  Steve     56
d    Bob     43
g   José     35

In [27]:
df.values

array([['Bill', 21],
       ['Fill', 87],
       ['Steve', 56],
       ['Bob', 43],
       ['Karina', 28],
       ['João', 30],
       ['José', 35]], dtype=object)

In [28]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [29]:
df.columns

Index(['nome', 'idade'], dtype='object')

In [ ]:
# Exemplo de read_sas
# df_2 = pd.read_sas('nome_da_base.sas')

In [30]:
df = pd.read_excel('bank-full.xlsx', sheet_name='Sheet 1 - bank-full')

In [32]:
df.head()

   age           job  marital  education  ... campaign  pdays previous poutcome
0   58    management  married   tertiary  ...        1     -1        0  unknown
1   44    technician   single  secondary  ...        1     -1        0  unknown
2   33  entrepreneur  married  secondary  ...        1     -1        0  unknown
3   47   blue-collar  married    unknown  ...        1     -1        0  unknown
4   33       unknown   single    unknown  ...        1     -1        0  unknown

[5 rows x 16 columns]

In [33]:
df.shape #(linhas, colunas)

(45211, 16)

In [36]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome'],
      dtype='object')

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.head(10)

   age           job   marital  education  ... campaign  pdays previous poutcome
0   58    management   married   tertiary  ...        1     -1        0  unknown
1   44    technician    single  secondary  ...        1     -1        0  unknown
2   33  entrepreneur   married  secondary  ...        1     -1        0  unknown
3   47   blue-collar   married    unknown  ...        1     -1        0  unknown
4   33       unknown    single    unknown  ...        1     -1        0  unknown
5   35    management   married   tertiary  ...        1     -1        0  unknown
6   28    management    single   tertiary  ...        1     -1        0  unknown
7   42  entrepreneur  divorced   tertiary  ...        1     -1        0  unknown
8   58       retired   married    primary  ...        1     -1        0  unknown
9   43    technician    single  secondary  ...        1     -1        0  unknown

[10 rows x 16 columns]

In [39]:
df.tail()

       age           job   marital  ... pdays previous  poutcome
45206   51    technician   married  ...    -1        0   unknown
45207   71       retired  divorced  ...    -1        0   unknown
45208   72       retired   married  ...   184        3   success
45209   57   blue-collar   married  ...    -1        0   unknown
45210   37  entrepreneur   married  ...   188       11     other

[5 rows x 16 columns]

In [42]:
df.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
dtype: object

In [43]:
df['age'].mean()

40.93621021432837

In [44]:
df['age'].std()

10.618762040975431

In [45]:
40.93 + (2*10.61)

62.15

In [46]:
40.93 - (2*10.61)

19.71

In [ ]:
# [19.71; 62.15]

In [ ]:
## fim